fio-test/results/write_out_conv/32k-psync-2.out
job1: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=111947: Sun Jun 23 13:49:47 2024
  write: IOPS=32.9k, BW=1028MiB/s (1078MB/s)(673GiB/670383msec); 0 zone resets
    clat (usec): min=55, max=2935, avg=234.68, stdev=71.79
     lat (usec): min=55, max=2937, avg=236.02, stdev=72.05
    clat percentiles (usec):
     |  1.00th=[  128],  5.00th=[  161], 10.00th=[  169], 20.00th=[  178],
     | 30.00th=[  186], 40.00th=[  194], 50.00th=[  217], 60.00th=[  251],
     | 70.00th=[  265], 80.00th=[  285], 90.00th=[  318], 95.00th=[  351],
     | 99.00th=[  510], 99.50th=[  578], 99.90th=[  644], 99.95th=[  676],
     | 99.99th=[  775]
   bw (  MiB/s): min=  686, max= 1881, per=100.00%, avg=1052.15, stdev=26.85, samples=10483
   iops        : min=21978, max=60212, avg=33667.48, stdev=859.19, samples=10483
  lat (usec)   : 100=0.87%, 250=58.32%, 500=39.77%, 750=1.03%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=2.10%, sys=5.65%, ctx=22057127, majf=0, minf=138
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,22056960,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1028MiB/s (1078MB/s), 1028MiB/s-1028MiB/s (1078MB/s-1078MB/s), io=673GiB (723GB), run=670383-670383msec

Disk stats (read/write):
    dm-0: ios=48/22056782, merge=0/0, ticks=0/4868116, in_queue=4868116, util=100.00%, aggrios=11/4411392, aggrmerge=0/0, aggrticks=0/139844, aggrin_queue=139845, aggrutil=100.00%
  nvme0n1: ios=0/3859968, merge=0/0, ticks=0/125563, in_queue=125564, util=100.00%
  nvme3n1: ios=0/3859968, merge=0/0, ticks=0/122688, in_queue=122689, util=99.99%
  nvme1n2: ios=26/4962816, merge=0/0, ticks=2/157223, in_queue=157226, util=100.00%
  nvme4n2: ios=12/4962816, merge=0/0, ticks=1/151394, in_queue=151395, util=100.00%
  nvme2n1: ios=0/3859968, merge=0/0, ticks=0/122705, in_queue=122706, util=100.00%
  nvme0n2: ios=36/4962816, merge=0/0, ticks=2/160665, in_queue=160668, util=100.00%
  nvme3n2: ios=18/4962816, merge=0/0, ticks=2/155822, in_queue=155823, util=100.00%
  nvme1n1: ios=0/3859968, merge=0/0, ticks=0/122770, in_queue=122770, util=99.99%
  nvme4n1: ios=0/3859968, merge=0/0, ticks=0/122406, in_queue=122406, util=99.99%
  nvme2n2: ios=20/4962816, merge=0/0, ticks=1/157209, in_queue=157211, util=100.00%